src/cf/InformationRegisters/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>УстановкаЦен</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипыЦенНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Закупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/УправлениеЦеами/Ext/Module.bsl
Функция АктуальнаяЦенаРозница(АктуальнаяДата, СсылкаНоменклатура) Экспорт
	
	Цена = ПолучитьЦену(АктуальнаяДата, СсылкаНоменклатура, Перечисления.ТипыЦенНоменклатуры.Розница);
	
	Возврат Цена; 
КонецФункции

Функция АктуальнаяЦенаЗакупка(АктуальнаяДата, СсылкаНоменклатура) Экспорт
	
	Цена = ПолучитьЦену(АктуальнаяДата, СсылкаНоменклатура, Перечисления.ТипыЦенНоменклатуры.Закупка);
	
	Возврат Цена; 
КонецФункции

Функция ПолучитьЦену(Знач АктуальнаяДата, Знач СсылкаНоменклатура, Знач ТипЦеныНоменклатуры)
	
	Перем ЗначениеРесурсов, Отбор;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипыЦенНоменклатуры", ТипЦеныНоменклатуры); 
	Отбор.Вставить("Номенклатура", СсылкаНоменклатура);
	ЗначениеРесурсов = РегистрыСведений.УстановкаЦен.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат ЗначениеРесурсов.Цена;
	
КонецФункции
